5.01. Сделать дартс. 
Всё так же как мы и делали на уроке.
С 4 кругами. 1 - красный, 2 - синий, 3 - жёлтый, 4 - зелёный.
- 1 красный самый маленький - 40на40;
- 2 синий - 80на80;
- 3 жёлтый - 160на160;
- 4 зелёный - 320на320;

Я думаю все понимают как выглядит darts: 
- https://cdn1.ozone.ru/multimedia/c2400/1014684405.jpg

При попадании по 1 кругу 10 очков, 2 - 8 очков, 3 - 5 очков, 4 - 2 очка

Так же при нажатии картинка должно меняться на эту гифку(gif-1) и должно пройти ровно 800 милисекунд до попадания, чтобы посчитало очко.

- gif-1: http://hddfhm.com/images/animated-clipart-darts-9.gif (якобы дротик летает)

И так же у нас ограниченное время игры. 30 секунд. Через 30 секунд игра заканчивается и мы просто играем заново(с нуля)

Дополительно(обязательно) - сделать, чтобы вокруг летали птицы рандомно. Можно сделать, чтобы пели (будет плюсиком) 
4 - птицы в gif формате. размерами 30x30, 30x30, 40x40, 50x50

И так же подключить музыку, чтобы играло на фоне.

И так же при попадании на разные круги были разные звуки по дереву или же того, что вы придумаете.(В пределах разумного)

